bdmihai/stm32-boot/STM32H7/STM32H7B0xx.s
.include "startup.s"

/******************************************************************************
 * These are the addresses for the initialized (data) variables. The initialized 
 * variables will be copied from FLASH to RAM. These addresses are set in the
 * linker file.
******************************************************************************/
.section .text.Reset_Handler
.align 4
copy_data_table:
    .word __isr_vector_source
    .word __isr_vector_start
    .word __isr_vector_end
    .word __data_source
    .word __data_start
    .word __data_end
    .word 0 // null terminator

/******************************************************************************
 * These are the addresses for the uninitialized (bss) variables. The
 * uninitialized variables will be set to 0. These addresses are set in the
 * linker file.
******************************************************************************/
.section .text.Reset_Handler
.align 4
zero_data_table:
    .word __bss_start
    .word __bss_end
    .word 0 // null terminator
    
.section  .isr_vector,"a",%progbits
  .type  g_pfnVectors, %object
  .size  g_pfnVectors, .-g_pfnVectors
   
   
g_pfnVectors:
    .word __stack_end
    .word  Reset_Handler

    .word  NMI_Handler
    .word  HardFault_Handler
    .word  MemManage_Handler
    .word  BusFault_Handler
    .word  UsageFault_Handler
    .word  0
    .word  0
    .word  0
    .word  0
    .word  SVC_Handler
    .word  DebugMon_Handler
    .word  0
    .word  PendSV_Handler
    .word  SysTick_Handler
  
    /* External Interrupts */
    .word     WWDG_IRQHandler                   /* Window WatchDog              */
    .word     PVD_PVM_IRQHandler                /* PVD/PVM through EXTI Line detection */
    .word     RTC_TAMP_STAMP_CSS_LSE_IRQHandler /* Tamper and TimeStamps through the EXTI line */
    .word     RTC_WKUP_IRQHandler               /* RTC Wakeup through the EXTI line */
    .word     FLASH_IRQHandler                  /* FLASH                        */
    .word     RCC_IRQHandler                    /* RCC                          */
    .word     EXTI0_IRQHandler                  /* EXTI Line0                   */
    .word     EXTI1_IRQHandler                  /* EXTI Line1                   */
    .word     EXTI2_IRQHandler                  /* EXTI Line2                   */
    .word     EXTI3_IRQHandler                  /* EXTI Line3                   */
    .word     EXTI4_IRQHandler                  /* EXTI Line4                   */
    .word     DMA1_Stream0_IRQHandler           /* DMA1 Stream 0                */
    .word     DMA1_Stream1_IRQHandler           /* DMA1 Stream 1                */
    .word     DMA1_Stream2_IRQHandler           /* DMA1 Stream 2                */
    .word     DMA1_Stream3_IRQHandler           /* DMA1 Stream 3                */
    .word     DMA1_Stream4_IRQHandler           /* DMA1 Stream 4                */
    .word     DMA1_Stream5_IRQHandler           /* DMA1 Stream 5                */
    .word     DMA1_Stream6_IRQHandler           /* DMA1 Stream 6                */
    .word     ADC_IRQHandler                    /* ADC1, ADC2 and ADC3s         */
    .word     FDCAN1_IT0_IRQHandler             /* FDCAN1 interrupt line 0      */
    .word     FDCAN2_IT0_IRQHandler             /* FDCAN2 interrupt line 0      */
    .word     FDCAN1_IT1_IRQHandler             /* FDCAN1 interrupt line 1      */
    .word     FDCAN2_IT1_IRQHandler             /* FDCAN2 interrupt line 1      */
    .word     EXTI9_5_IRQHandler                /* External Line[9:5]s          */
    .word     TIM1_BRK_IRQHandler               /* TIM1 Break interrupt         */
    .word     TIM1_UP_IRQHandler                /* TIM1 Update interrupt        */
    .word     TIM1_TRG_COM_IRQHandler           /* TIM1 Trigger and Commutation interrupt */
    .word     TIM1_CC_IRQHandler                /* TIM1 Capture Compare         */
    .word     TIM2_IRQHandler                   /* TIM2                         */
    .word     TIM3_IRQHandler                   /* TIM3                         */
    .word     TIM4_IRQHandler                   /* TIM4                         */
    .word     I2C1_EV_IRQHandler                /* I2C1 Event                   */
    .word     I2C1_ER_IRQHandler                /* I2C1 Error                   */
    .word     I2C2_EV_IRQHandler                /* I2C2 Event                   */
    .word     I2C2_ER_IRQHandler                /* I2C2 Error                   */
    .word     SPI1_IRQHandler                   /* SPI1                         */
    .word     SPI2_IRQHandler                   /* SPI2                         */
    .word     USART1_IRQHandler                 /* USART1                       */
    .word     USART2_IRQHandler                 /* USART2                       */
    .word     USART3_IRQHandler                 /* USART3                       */
    .word     EXTI15_10_IRQHandler              /* External Line[15:10]s        */
    .word     RTC_Alarm_IRQHandler              /* RTC Alarm (A and B) through EXTI Line */
    .word     DFSDM2_IRQHandler                 /* DFSDM2 Interrupt             */
    .word     TIM8_BRK_TIM12_IRQHandler         /* TIM8 Break and TIM12         */
    .word     TIM8_UP_TIM13_IRQHandler          /* TIM8 Update and TIM13        */
    .word     TIM8_TRG_COM_TIM14_IRQHandler     /* TIM8 Trigger and Commutation and TIM14 */
    .word     TIM8_CC_IRQHandler                /* TIM8 Capture Compare         */
    .word     DMA1_Stream7_IRQHandler           /* DMA1 Stream7                 */
    .word     FMC_IRQHandler                    /* FMC                          */
    .word     SDMMC1_IRQHandler                 /* SDMMC1                       */
    .word     TIM5_IRQHandler                   /* TIM5                         */
    .word     SPI3_IRQHandler                   /* SPI3                         */
    .word     UART4_IRQHandler                  /* UART4                        */
    .word     UART5_IRQHandler                  /* UART5                        */
    .word     TIM6_DAC_IRQHandler               /* TIM6 and DAC1&2 underrun errors */
    .word     TIM7_IRQHandler                   /* TIM7                         */
    .word     DMA2_Stream0_IRQHandler           /* DMA2 Stream 0                */
    .word     DMA2_Stream1_IRQHandler           /* DMA2 Stream 1                */
    .word     DMA2_Stream2_IRQHandler           /* DMA2 Stream 2                */
    .word     DMA2_Stream3_IRQHandler           /* DMA2 Stream 3                */
    .word     DMA2_Stream4_IRQHandler           /* DMA2 Stream 4                */
    .word     0                                 /* Reserved                     */
    .word     0                                 /* Reserved                     */
    .word     FDCAN_CAL_IRQHandler              /* FDCAN calibration unit interrupt*/
    .word     DFSDM1_FLT4_IRQHandler            /* DFSDM Filter4 Interrupt      */
    .word     DFSDM1_FLT5_IRQHandler            /* DFSDM Filter5 Interrupt      */
    .word     DFSDM1_FLT6_IRQHandler            /* DFSDM Filter6 Interrupt      */
    .word     DFSDM1_FLT7_IRQHandler            /* DFSDM Filter7 Interrupt      */
    .word     DMA2_Stream5_IRQHandler           /* DMA2 Stream 5                */
    .word     DMA2_Stream6_IRQHandler           /* DMA2 Stream 6                */
    .word     DMA2_Stream7_IRQHandler           /* DMA2 Stream 7                */
    .word     USART6_IRQHandler                 /* USART6                       */
    .word     I2C3_EV_IRQHandler                /* I2C3 event                   */
    .word     I2C3_ER_IRQHandler                /* I2C3 error                   */
    .word     OTG_HS_EP1_OUT_IRQHandler         /* USB OTG HS End Point 1 Out   */
    .word     OTG_HS_EP1_IN_IRQHandler          /* USB OTG HS End Point 1 In    */
    .word     OTG_HS_WKUP_IRQHandler            /* USB OTG HS Wakeup through EXTI */
    .word     OTG_HS_IRQHandler                 /* USB OTG HS                   */
    .word     DCMI_PSSI_IRQHandler              /* DCMI, PSSI                   */
    .word     CRYP_IRQHandler                   /* CRYP crypto global interrupt */
    .word     HASH_RNG_IRQHandler               /* RNG, HASH                    */
    .word     FPU_IRQHandler                    /* FPU                          */
    .word     UART7_IRQHandler                  /* UART7                        */
    .word     UART8_IRQHandler                  /* UART8                        */
    .word     SPI4_IRQHandler                   /* SPI4                         */
    .word     SPI5_IRQHandler                   /* SPI5                         */
    .word     SPI6_IRQHandler                   /* SPI6                         */
    .word     SAI1_IRQHandler                   /* SAI1                         */
    .word     LTDC_IRQHandler                   /* LTDC                         */
    .word     LTDC_ER_IRQHandler                /* LTDC error                   */
    .word     DMA2D_IRQHandler                  /* DMA2D                        */
    .word     SAI2_IRQHandler                   /* SAI2                         */
    .word     OCTOSPI1_IRQHandler               /* OCTOSPI1                     */
    .word     LPTIM1_IRQHandler                 /* LPTIM1                       */
    .word     CEC_IRQHandler                    /* HDMI_CEC                     */
    .word     I2C4_EV_IRQHandler                /* I2C4 Event                   */
    .word     I2C4_ER_IRQHandler                /* I2C4 Error                   */
    .word     SPDIF_RX_IRQHandler               /* SPDIF_RX                     */
    .word     0                                 /* Reserved                     */
    .word     0                                 /* Reserved                     */
    .word     0                                 /* Reserved                     */
    .word     0                                 /* Reserved                     */
    .word     DMAMUX1_OVR_IRQHandler            /* DMAMUX1 Overrun interrupt    */
    .word     0                                 /* Reserved                     */
    .word     0                                 /* Reserved                     */
    .word     0                                 /* Reserved                     */
    .word     0                                 /* Reserved                     */
    .word     0                                 /* Reserved                     */
    .word     0                                 /* Reserved                     */
    .word     0                                 /* Reserved                     */
    .word     DFSDM1_FLT0_IRQHandler            /* DFSDM Filter0 Interrupt      */
    .word     DFSDM1_FLT1_IRQHandler            /* DFSDM Filter1 Interrupt      */
    .word     DFSDM1_FLT2_IRQHandler            /* DFSDM Filter2 Interrupt      */
    .word     DFSDM1_FLT3_IRQHandler            /* DFSDM Filter3 Interrupt      */
    .word     0                                 /* Reserved                     */
    .word     SWPMI1_IRQHandler                 /* Serial Wire Interface 1 global interrupt */
    .word     TIM15_IRQHandler                  /* TIM15 global Interrupt      */ 
    .word     TIM16_IRQHandler                  /* TIM16 global Interrupt      */
    .word     TIM17_IRQHandler                  /* TIM17 global Interrupt      */
    .word     MDIOS_WKUP_IRQHandler             /* MDIOS Wakeup  Interrupt     */
    .word     MDIOS_IRQHandler                  /* MDIOS global Interrupt      */
    .word     JPEG_IRQHandler                   /* JPEG global Interrupt       */
    .word     MDMA_IRQHandler                   /* MDMA global Interrupt       */
    .word     0                                 /* Reserved                    */
    .word     SDMMC2_IRQHandler                 /* SDMMC2 global Interrupt     */
    .word     HSEM1_IRQHandler                  /* HSEM1 global Interrupt      */
    .word     0                                 /* Reserved                    */
    .word     DAC2_IRQHandler                   /* DAC2 global Interrupt       */
    .word     DMAMUX2_OVR_IRQHandler            /* DMAMUX Overrun interrupt    */
    .word     BDMA2_Channel0_IRQHandler         /* BDMA2 Channel 0 global Interrupt */
    .word     BDMA2_Channel1_IRQHandler         /* BDMA2 Channel 1 global Interrupt */
    .word     BDMA2_Channel2_IRQHandler         /* BDMA2 Channel 2 global Interrupt */
    .word     BDMA2_Channel3_IRQHandler         /* BDMA2 Channel 3 global Interrupt */
    .word     BDMA2_Channel4_IRQHandler         /* BDMA2 Channel 4 global Interrupt */
    .word     BDMA2_Channel5_IRQHandler         /* BDMA2 Channel 5 global Interrupt */
    .word     BDMA2_Channel6_IRQHandler         /* BDMA2 Channel 6 global Interrupt */
    .word     BDMA2_Channel7_IRQHandler         /* BDMA2 Channel 7 global Interrupt */
    .word     COMP_IRQHandler                   /* COMP global Interrupt      */   
    .word     LPTIM2_IRQHandler                 /* LP TIM2 global interrupt     */
    .word     LPTIM3_IRQHandler                 /* LP TIM3 global interrupt     */
    .word     UART9_IRQHandler                  /* UART9 global interrupt       */
    .word     USART10_IRQHandler                /* USART10 global interrupt     */
    .word     LPUART1_IRQHandler                /* LP UART1 interrupt           */
    .word     0                                 /* Reserved                     */
    .word     CRS_IRQHandler                    /* Clock Recovery Global Interrupt */
    .word     ECC_IRQHandler                    /* ECC diagnostic Global Interrupt */
    .word     0                                 /* Reserved                     */
    .word     DTS_IRQHandler                    /* DTS                          */
    .word     0                                 /* Reserved                     */
    .word     WAKEUP_PIN_IRQHandler             /* Interrupt for all 6 wake-up pins */
    .word     OCTOSPI2_IRQHandler               /* OCTOSPI2                     */
    .word     OTFDEC1_IRQHandler                /* OTFDEC1                      */
    .word     OTFDEC2_IRQHandler                /* OTFDEC2                      */
    .word     GFXMMU_IRQHandler                 /* GFXMMU                       */
    .word     BDMA1_IRQHandler                  /* BDMA1                        */

