bdmihai/stm32-boot/STM32H7/STM32H7B0xx.s
.weak      DFSDM1_FLT5_IRQHandler
.thumb_set DFSDM1_FLT5_IRQHandler,Default_Handler 

.weak      DFSDM1_FLT6_IRQHandler   
.thumb_set DFSDM1_FLT6_IRQHandler,Default_Handler 

.weak      DFSDM1_FLT7_IRQHandler
.thumb_set DFSDM1_FLT7_IRQHandler,Default_Handler
   
.weak      DMA2_Stream5_IRQHandler
.thumb_set DMA2_Stream5_IRQHandler,Default_Handler

.weak      DMA2_Stream6_IRQHandler
.thumb_set DMA2_Stream6_IRQHandler,Default_Handler

.weak      DMA2_Stream7_IRQHandler
.thumb_set DMA2_Stream7_IRQHandler,Default_Handler

.weak      USART6_IRQHandler
.thumb_set USART6_IRQHandler,Default_Handler

.weak      I2C3_EV_IRQHandler
.thumb_set I2C3_EV_IRQHandler,Default_Handler

.weak      I2C3_ER_IRQHandler
.thumb_set I2C3_ER_IRQHandler,Default_Handler

.weak      OTG_HS_EP1_OUT_IRQHandler
.thumb_set OTG_HS_EP1_OUT_IRQHandler,Default_Handler

.weak      OTG_HS_EP1_IN_IRQHandler
.thumb_set OTG_HS_EP1_IN_IRQHandler,Default_Handler

.weak      OTG_HS_WKUP_IRQHandler
.thumb_set OTG_HS_WKUP_IRQHandler,Default_Handler
            
.weak      OTG_HS_IRQHandler
.thumb_set OTG_HS_IRQHandler,Default_Handler

.weak      DCMI_PSSI_IRQHandler
.thumb_set DCMI_PSSI_IRQHandler,Default_Handler

.weak      CRYP_IRQHandler
.thumb_set CRYP_IRQHandler,Default_Handler   

.weak      HASH_RNG_IRQHandler
.thumb_set HASH_RNG_IRQHandler,Default_Handler

.weak      FPU_IRQHandler
.thumb_set FPU_IRQHandler,Default_Handler

.weak      UART7_IRQHandler
.thumb_set UART7_IRQHandler,Default_Handler

.weak      UART8_IRQHandler
.thumb_set UART8_IRQHandler,Default_Handler

.weak      SPI4_IRQHandler
.thumb_set SPI4_IRQHandler,Default_Handler

.weak      SPI5_IRQHandler
.thumb_set SPI5_IRQHandler,Default_Handler

.weak      SPI6_IRQHandler
.thumb_set SPI6_IRQHandler,Default_Handler

.weak      SAI1_IRQHandler
.thumb_set SAI1_IRQHandler,Default_Handler

.weak      LTDC_IRQHandler
.thumb_set LTDC_IRQHandler,Default_Handler

.weak      LTDC_ER_IRQHandler
.thumb_set LTDC_ER_IRQHandler,Default_Handler

.weak      DMA2D_IRQHandler
.thumb_set DMA2D_IRQHandler,Default_Handler

.weak      SAI2_IRQHandler
.thumb_set SAI2_IRQHandler,Default_Handler

.weak      OCTOSPI1_IRQHandler
.thumb_set OCTOSPI1_IRQHandler,Default_Handler
 
.weak      LPTIM1_IRQHandler
.thumb_set LPTIM1_IRQHandler,Default_Handler

.weak      CEC_IRQHandler
.thumb_set CEC_IRQHandler,Default_Handler
   
.weak      I2C4_EV_IRQHandler
.thumb_set I2C4_EV_IRQHandler,Default_Handler 
 
.weak      I2C4_ER_IRQHandler
.thumb_set I2C4_ER_IRQHandler,Default_Handler
   
.weak      SPDIF_RX_IRQHandler
.thumb_set SPDIF_RX_IRQHandler,Default_Handler

.weak      DMAMUX1_OVR_IRQHandler
.thumb_set DMAMUX1_OVR_IRQHandler,Default_Handler

.weak      DFSDM1_FLT0_IRQHandler
.thumb_set DFSDM1_FLT0_IRQHandler,Default_Handler

.weak      DFSDM1_FLT1_IRQHandler
.thumb_set DFSDM1_FLT1_IRQHandler,Default_Handler

.weak      DFSDM1_FLT2_IRQHandler
.thumb_set DFSDM1_FLT2_IRQHandler,Default_Handler

.weak      DFSDM1_FLT3_IRQHandler
.thumb_set DFSDM1_FLT3_IRQHandler,Default_Handler

.weak      SWPMI1_IRQHandler
.thumb_set SWPMI1_IRQHandler,Default_Handler

.weak      TIM15_IRQHandler
.thumb_set TIM15_IRQHandler,Default_Handler

.weak      TIM16_IRQHandler
.thumb_set TIM16_IRQHandler,Default_Handler

.weak      TIM17_IRQHandler
.thumb_set TIM17_IRQHandler,Default_Handler

.weak      MDIOS_WKUP_IRQHandler
.thumb_set MDIOS_WKUP_IRQHandler,Default_Handler

.weak      MDIOS_IRQHandler
.thumb_set MDIOS_IRQHandler,Default_Handler

.weak      JPEG_IRQHandler
.thumb_set JPEG_IRQHandler,Default_Handler

.weak      MDMA_IRQHandler
.thumb_set MDMA_IRQHandler,Default_Handler

.weak      SDMMC2_IRQHandler
.thumb_set SDMMC2_IRQHandler,Default_Handler
   
.weak      HSEM1_IRQHandler
.thumb_set HSEM1_IRQHandler,Default_Handler

.weak      DAC2_IRQHandler
.thumb_set DAC2_IRQHandler,Default_Handler

.weak      DMAMUX2_OVR_IRQHandler
.thumb_set DMAMUX2_OVR_IRQHandler,Default_Handler

.weak      BDMA2_Channel0_IRQHandler
.thumb_set BDMA2_Channel0_IRQHandler,Default_Handler

.weak      BDMA2_Channel1_IRQHandler
.thumb_set BDMA2_Channel1_IRQHandler,Default_Handler

.weak      BDMA2_Channel2_IRQHandler
.thumb_set BDMA2_Channel2_IRQHandler,Default_Handler

.weak      BDMA2_Channel3_IRQHandler
.thumb_set BDMA2_Channel3_IRQHandler,Default_Handler

.weak      BDMA2_Channel4_IRQHandler
.thumb_set BDMA2_Channel4_IRQHandler,Default_Handler

.weak      BDMA2_Channel5_IRQHandler
.thumb_set BDMA2_Channel5_IRQHandler,Default_Handler

.weak      BDMA2_Channel6_IRQHandler
.thumb_set BDMA2_Channel6_IRQHandler,Default_Handler

.weak      BDMA2_Channel7_IRQHandler
.thumb_set BDMA2_Channel7_IRQHandler,Default_Handler

.weak      COMP_IRQHandler
.thumb_set COMP_IRQHandler,Default_Handler

.weak      LPTIM2_IRQHandler
.thumb_set LPTIM2_IRQHandler,Default_Handler

.weak      LPTIM3_IRQHandler
.thumb_set LPTIM3_IRQHandler,Default_Handler

.weak      LPTIM4_IRQHandler
.thumb_set LPTIM4_IRQHandler,Default_Handler

.weak      LPTIM5_IRQHandler
.thumb_set LPTIM5_IRQHandler,Default_Handler

.weak      UART9_IRQHandler
.thumb_set UART9_IRQHandler,Default_Handler

.weak      USART10_IRQHandler
.thumb_set USART10_IRQHandler,Default_Handler
   
.weak      LPUART1_IRQHandler
.thumb_set LPUART1_IRQHandler,Default_Handler

.weak      CRS_IRQHandler
.thumb_set CRS_IRQHandler,Default_Handler

.weak      ECC_IRQHandler
.thumb_set ECC_IRQHandler,Default_Handler

.weak      DTS_IRQHandler
.thumb_set DTS_IRQHandler,Default_Handler

.weak      WAKEUP_PIN_IRQHandler
.thumb_set WAKEUP_PIN_IRQHandler,Default_Handler

.weak      OCTOSPI2_IRQHandler
.thumb_set OCTOSPI2_IRQHandler,Default_Handler

.weak      OTFDEC1_IRQHandler
.thumb_set OTFDEC1_IRQHandler,Default_Handler

.weak      OTFDEC2_IRQHandler
.thumb_set OTFDEC2_IRQHandler,Default_Handler
   
.weak      GFXMMU_IRQHandler
.thumb_set GFXMMU_IRQHandler,Default_Handler

.weak      BDMA1_IRQHandler
.thumb_set BDMA1_IRQHandler,Default_Handler
   
 
